Tutorial_case_1_flap/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         pimpleFoam;

//startFrom           startTime;
startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             20.0;

deltaT              0.005;

writeControl        adjustableRunTime;

writeInterval       0.01;

purgeWrite          0;

writeFormat         ascii;

writePrecision      12;

writeCompression    off;

timeFormat          general;

timePrecision       8;

functions
{
    // Function object "KratosOpenfoamAdapterFunctionObject" to couple OpenFOAM with CoSimulation (kratos)
    KratosOpenfoamAdapterFunctionObject1
    {
        type KratosOpenfoamAdapterFunctionObject;
        libs ("../KratosOpenfoamAdapterFunctionObject/libKratosOpenfoamAdapterFunctionObjectFunctionObjects.so");

        interfaces
        {
            Interface1
            {
                name                    interface_flap;
                patches                 (flap);
                importDataIdentifier    (disp_interface_flap_ordered);
                exportDataIdentifier    (load_interface_flap_ordered);
            }
        }

        parameters
        {
            rho rho [1 -3 0 0 0 0 0] 0.00118;
            nu nu [0 2 -1 0 0 0 0 ] 0.1542;
        }

        dim 3;
        debugLevel info;
    }

    // Function object "CourantNo" to see courant number
    Co1
    {
        type                CourantNo;
        libs                ("libfieldFunctionObjects.so");
        executeControl      timeStep;
        executeInterval     2;
        writeControl        writeTime;
    }

    // Function object "forces" to calcuate the total force on interface
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              0.00118;
        CofR                (0 0 0);
    }

    // Fcuntion object "Residual", To see the residual plots
    // foamMonitor -l ./postProcessing/residuals/0/residuals.dat
    #includeFunc residuals

    // Function object "probes", To plot the displacements of the flap
    // Specify this point in the system/probes file - > (9.45 6.05 0.0)
    #includeFunc probes

}

// ************************************************************************* //
